import vars
import os
from ferramentas_diverças import limpa_tela


def status():
    while 1: #loop infinito, vai reduzir algumas linhas no codigo
        limpa_tela()
        print(" ________________________________________________________")
        print("|//Vida:",vars.vida,"///////////////////////////////","poções:",vars.poçoes,"//|")
        print("|////////////////////////////////////////////////////////|")
        print("|////////////////////////////////////////////////////////|")
        print("|////////////////////////////////////////////////////////|")
        print("|//Defesa:",vars.defesa,"///////////////////////////////","Atack:",vars.atack,"//|")
        print("|////////////////////////////////////////////////////////|")
        print("|////////////////////////////////////////////////////////|")
        print("|////////////////////Dinhero:",vars.dinheiro,"///////////////////////|")
        print("|////////////////////////////////////////////////////////|")
        print("|//////////////////////1- sair///////////////////////////|")
        print("|________________________________________________________|")
        vars.text = int(input('oque fazer? '))

        #sair#
        if vars.text == 1:
            return
        else:
            pass

if __name__ == '__main__':
     status()
